**** (3) Compute the v_s_30 from the soil profile table

Each row is a layer existing on the top 30m.

Where
+ v : shear wave velocity (at a shear strain level of 1e-5 or less)
+ h : the thickness [m]

#+NAME: soil_profile
|  h | v |
|----+---|
| 10 | 1 |
| 20 | 2 |
| 30 | 3 |

#+BEGIN_SRC emacs-lisp :var p=soil_profile :results both
  (defun sum (l)
    "sum a list"
    (setq r 0)
    (mapcar (lambda (x) (setq r (+ x r)))
            l
            )
    r
    )

  (defun div (c)
    "divide the cons cell.
    (a b) -> a/b"
    (/ (float (first c))
       (float (second c))
       )
    )

  (setq h_v (mapcar #'div d))
  (setq S (sum h_v))
  (/ 30 S)
#+END_SRC

#+RESULTS:
: 150.0
